Repository: servo-cam/documentation
Catalog: docs/source/locale/*/LC_MESSAGES/requirements.po
Languages: pl

source: In this configuration, the computer controlling the whole (server) is connected to the Raspberry via a serial port (**USB**). The Raspberry uses the built-in **GPIO pins of the PWM type** to control the servos here. The camera must be connected directly to the control computer via the USB port. The control software here takes care of the computational part and controls the movement of the servo motors via the connected Raspberry by passing commands to it. To use this configuration, run the client application available in the **Client / PC, Raspberry** directory on the Raspberry, and then on the desktop (server) application, select the **CAM (USB)** operating mode and select the USB camera from the list and select the servo connection using the options in the **Servo > Local > (serial port address)** menu. In this configuration, any computer can be used instead of a Raspberry.
pl: W tej konfiguracji komputer sterujący całoscią (serwer) podłączony jest do Raspberry za pomocą portu szeregowego (**USB**). Raspberry za pomocą wbudowanych wyprowadzeń **GPIO typu PWM** steruje tutaj serwomechanizmami. Kamera musi być podłączona bezpośrednio do komputera sterującego za pomocą portu USB. Oprogramowanie sterujące zajmuje się tutaj częścią obliczeniową i steruje ruchem serwomotorów za pomocą podłączonego Raspberry poprzez przekazywane do niego komendy. Aby wykorzystać tę konfigurację należy uruchomić na Raspberry aplikację kliencką dostępną w katalogu **Client / PC, Raspberry**, a następnie z poziomu aplikacji desktopowej (serwerowej) wybrać tryb pracy **KAM (USB)** i wybrać z listy kamerę USB oraz wybrać połączenie serwa za pomocą opcji w menu **Serwo / Lokalne / (adres portu szeregowego)**. W tej konfiguracji zamiast Raspberry można użyć dowolnego komputera.

source: Connecting pins in **Raspberry** (locally), on the example of **Raspberry Pi 3 Model A+**:
pl: Podłączenie pinów w **Raspberry** (lokalnie), na przykładzie **Raspberry Pi 3 Model A+**:

source: The pin configuration can be changed in the **config.ini** file - located in the directory with the client application, this file is copied to the user's directory during the first run and should be edited there.
pl: Konfigurację pinów można zmienić w pliku **config.ini** - znajdującym się w katalogu z aplikacją klienta, plik ten jest kopiowany do katalogu użytkownika podczas pierwszego uruchomienia i tam powinien być edytowany.

source: The configuration is analogous to the connection configuration via Wifi, with the only difference that the connection to the Raspberry / PC is via the USB port instead of via WiFi.
pl: Konfiguracja jest analogiczna do konfiguracji połączeniowej poprzez Wifi, z jedyną różnicą, że połączenie z Raspberry / PC odbywa się za pomocą portu USB zamiast poprzez WiFi.
