Repository: servo-cam/documentation
Catalog: docs/source/locale/*/LC_MESSAGES/requirements.po
Languages: pl

source: Requirements and connection
pl: Wymagania i podłączenie

source: Hardware
pl: Hardware (sprzęt)

source: The following main components are required to build the project:
pl: Do zbudowania konstrukcji wymagane są następujące główne komponenty:

source: **USB**, **HDMI** or **CSI** camera
pl: kamera **USB** lub **CSI** (jeśli podłączane pod Raspberry)

source: **2x servo** - one each for X and Y axes
pl: **2x serwomechanizm** o dowolnej mocy, po jednym dla osi X i Y

source: **hardware driver for servos** - possible solutions: Arduino microcontroller or minicomputer in the form of Raspberry Pi/Jetson Nano or external servo driver/controller
pl: **sterownik sprzętowy** dla serwomechanizmów, w postaci mikrokontrolera jak Arduino, minikomputera Raspberry lub Nvidia Jetson lub zewn. układu ze sterownikiem serwa

source: Software
pl: Software (oprogramowanie)

source: System requirements for bundled software:
pl: Wymaganie systemowe dla załączonego oprogramowania:

source: **Windows 10** (64bit) for Windows version (desktop)
pl: **Windows 10** (64bit) dla wersji windowsowej (desktop)

source: **Linux** (64bit) for Linux version (desktop)
pl: **Linux** (64bit) dla wersji linuxowej (desktop)

source: **optional:** web browser with GPU support for the browser version (Google Chrome recommended)
pl: **opcjonalnie:** przeglądarka WWW ze wsparciem dla GPU dla wersji przeglądarkowej (zalecany Google Chrome)

source: the included software supports **PC (Windows, Linux)**, **Raspberry Pi** and **Arduino**.
pl: załączone oprogramowanie obsługuje **PC (Windows, Linux)**, **Raspberry Pi** i **Arduino**.

source: No GPU is required to run the software.
pl: Do działania oprogramowania nie jest wymagane GPU.

source: In the absence of a GPU, all calculations will be done by the CPU.
pl: W przypadku braku GPU wszystkie obliczenia będą dokonywane przez CPU.

source: Sample Components
pl: Przykładowe komponenty

source: Below is a list of components required to prepare an example construction with links to an example store (Botland):
pl: Poniżej znajduje się lista komponentów wymaganych do przygotowania przykładowej konstrukcji wraz z linkami do przykładowego sklepu (Botland):

source: Local connection (PC + Arduino)
pl: Podłączenie lokalne (PC + Arduino)

source: **Arduino Nano:** https://botland.store/arduino-nano-boards/12960-arduino-nano-module-a000005-7630049200173.html
pl: **Arduino Nano:** https://botland.com.pl/arduino-seria-nano-oryginalne-plytki/12960-arduino-nano-a000005-7630049200173.html

source: **Arducam OV2710 2Mpx 1/2.7' USB camera:** https://botland.store/arduino-rpi-cameras/16896-arducam-ov2710-camera-2mpx-1-27-usb-automatic-ir-cut-filter-1080p-arducam-b0205-5904422345136.html
pl: **Kamera Arducam OV2710 2Mpx 1/2,7' USB:** https://botland.com.pl/kamery-do-arduino-i-raspberry-pi/16896-kamera-arducam-ov2710-2mpx-127-usb-automatyczny-filtr-ir-cut-1080p-arducam-b0205-5904422345136.html

source: **Camera mount:** https://botland.store/rpi-zero-mounting-elements/20898-pro-mini-camera-mount-holder-for-the-official-camera-and-raspberry-pi-zero-pihut-tph-069-5904422382735.html
pl: **Uchwyt do kamery:** https://botland.com.pl/elementy-montazowe-do-raspberry-pi-zero/20898-pro-mini-camera-mount-uchwyt-do-oficjalnej-kamery-i-raspberry-pi-zero-pihut-tph-069-5904422382735.html

source: **IR-CUT camera mount:** https://botland.store/raspberry-pi-camera-accessories/10324-ir-cut-camera-case-open-black-5904422315542.html10324-obudowa-do-kamery-ir-cut-otwarta-czarna-5904422315542.html
pl: **Obudowa do kamery IR-CUT:** https://botland.com.pl/tasmy-ffc-i-obudowy-do-kamer-do-raspberry-pi/10324-obudowa-do-kamery-ir-cut-otwarta-czarna-5904422315542.html

source: **2x standard-size servo Tower Pro MG995 + Pan/Tilt Kit:** https://botland.store/grapplers-and-gimbals/2546-pantilt-servo-bracket-kit-servos-dagu-6952581600800.html
pl: **2x serwomechanizm standard Tower Pro MG995 + uchwyt do serw standard Pan/Tilt Kit:** https://botland.com.pl/chwytaki-uchwyty-gimbale/2546-uchwyt-do-serw-pantilt-kit-serwa-dagu-6952581600800.html

source: **Aluminum servo mount Feetech FK-MB-001:** https://botland.store/grapplers-and-gimbals/9208-aluminium-servo-mount-feetech-fk-mb-001-black-5904422312992.html
pl: **Aluminiowy uchwyt do serwa Feetech FK-MB-001:** https://botland.com.pl/chwytaki-uchwyty-gimbale/9208-aluminiowy-uchwyt-do-serwa-feetech-fk-mb-001-czarny-5904422312992.html

source: **Aluminum servo clamp Feetech FK-RP-001 - 20mm / 6mm:** https://botland.store/servo-horns-hooks/9198-round-aluminum-servo-horn-feetech-fk-rp-001-20mm-6mm-5904422337698.html
pl: **Aluminiowy orczyk do serwa Feetech FK-RP-001 - 20mm / 6mm**: https://botland.com.pl/orczyki-do-serw/9198-aluminiowy-okragly-orczyk-feetech-fk-rp-001-20mm-6mm-5904422337698.html

source: **Hub USB 2.0 4-ports Esperanza EA-112:** https://botland.store/usb-hubs/1199-usb-20-hub-4-ports-esperanza-ea-112-5905784768564.html
pl: **Hub USB 2.0 4-porty Esperanza EA-112:** https://botland.com.pl/huby-usb/1199-hub-usb-20-4-porty-esperanza-ea-112-5905784768564.html

source: **5V power supply module with DC socket:** https://botland.store/power-modules/9420-power-module-33v-5v-with-dc-jack-5904422313302.html
pl: **Moduł zasilający 5V z gniazdem DC:** https://botland.com.pl/moduly-zasilajace/9420-modul-zasilajacy-33v-5v-z-gniazdem-dc-5904422313302.html

source: **Switching power supply 9V/2A:** https://botland.store/socket-power-supply/7158-power-supply-9v-2a-dc-55-21mm-5902135147375.html
pl: **Zasilacz impulsowy 9V/2A:** https://botland.com.pl/zasilacze-dogniazdkowe/7158-zasilacz-impulsowy-9v2a-wtyk-dc-5521mm-5902135147375.html

source: **2x 60cm servo extension cable:** https://botland.store/servo-wires/648-extension-cord-for-servos-60cm-5904422329549.html
pl: **2x przedłużacz do serw 60cm:** https://botland.com.pl/przewody-do-serw/648-przedluzacz-do-serw-60cm-5904422329549.html

source: **5m active USB extension cable:** https://botland.store/usb-adapters/3860-active-usb-extension-cable-5m-5904100201327.html
pl: **Przedłużacz USB aktywny 5m:** https://botland.com.pl/przejsciowki-usb/3860-przedluzacz-aktywny-usb-5m-5904100201327.html

source: Remote connection (PC + Raspberry / Arduino / WiFi)
pl: Podłączenie zdalne (PC + Raspberry / Arduino / WiFi)

source: **Raspberry Pi 3 A+ with microUSB power supply:** https://botland.store/raspberry-pi-3a/13834-set-of-raspberry-pi-3a-wifi-original-case-power-supply-5v-25a-5903351241526.html
pl: **Raspberry Pi 3 A+ z zasilaczem microUSB:** https://botland.com.pl/raspberry-pi-3a/13834-zestaw-raspberry-pi-3a-wifi-oryginalna-obudowa-zasilacz-5v25a-5903351241526.html

source: **Goodram memory card M1AA microSD 16GB 100MB/s UHS-I klasa 10 with adapter:** https://botland.store/microsd-sd-cards/2123-memory-card-m1aa-goodram-microsd-16gb-100mb-s-5908267930137.html
pl: **Karta pamięci Goodram M1AA microSD 16GB 100MB/s UHS-I klasa 10 z adapterem:** https://botland.com.pl/karty-pamieci-microsd-sd/2123-karta-pamieci-goodram-m1aa-microsd-16gb-100mbs-uhs-i-klasa-10-z-adapterem-5908267930137.html

source: **Card reader CY BOX USB 3.0 - CF, SD, microSD:** https://www.amazon.co.uk/ICY-BOX-Reader-microSD-Memory/dp/B07B4R53WG
pl: **Czytnik kart CY BOX USB 3.0 - CF, SD, microSD:** https://www.x-kom.pl/p/629316-czytnik-kart-usb-icy-box-usb-30-cf-sd-microsd.html

source: **Camera HD Night Vision E OV5647 5Mpx - for Raspberry Pi + IR modules - Waveshare 10300 CSI:** https://botland.store/raspberry-pi-cameras/4522-camera-hd-night-vision-e-ov5647-5mpx-for-5904422332860.html
pl: **Kamera HD Night Vision E OV5647 5Mpx - dla Raspberry Pi + moduły IR - Waveshare 10300 CSI:** https://botland.com.pl/kamery-do-raspberry-pi/4522-kamera-hd-night-vision-e-ov5647-5mpx-dla-raspberry-pi-moduly-ir-waveshare-10300-5904422332860.html

source: **Raspberry Pi camera CSI tape 60cm, 15 wires, raster 1mm:** https://botland.store/raspberry-pi-camera-accessories/2440-raspberry-pi-camera-ribbon-wire-60cm-15-wires-5904422359157.html
pl: **Taśma Raspberry Pi - kamera 60cm 15 żył raster 1mm:** https://botland.com.pl/tasmy-ffc-i-obudowy-do-kamer-do-raspberry-pi/2440-tasma-raspberry-pi-kamera-60cm-15-zyl-raster-1mm-5904422359157.html

source: **Raspberry Pi 3 A+ case transparent open:** https://botland.store/raspberry-pi-cases/13535-case-for-raspberry-pi-3-a-transparent-open-5904422320843.html
pl: **Obudowa Raspberry Pi 3 A+ przezroczysta otwarta:** https://botland.com.pl/obudowy-do-raspberry-pi/13535-obudowa-raspberry-pi-3-a-przezroczysta-otwarta-5904422320843.html

source: Possible connection configurations
pl: Możliwe konfiguracje połączeniowe

source: Below is a summary diagram of all possible configurations in which all the equipment can operate in the current version. The equipment can be connected both **locally** and **remotely**.
pl: Poniżej znajduje się zbiorczy schemat wszystkich możliwych konfiguracji w jakich w obecnej wersji może działać cały osprzęt. Sprzęt można podłączyć zarówno **lokalnie** jak i **zdalnie**.

source: Each of the connections has its pros and cons and its limitations - a local connection offers the lowest delays and the fastest data transfer, however, at the cost of lack of mobility, similarly, a remote connection causes minimal delays in data transfer, but allows remote control of the whole. The choice of connection method depends only on your own needs, requirements and technical capabilities. The software has been prepared to ensure operation in each of these configurations. There is also the possibility of controlling from the level of the public network (internet) - this will be described in the appropriate chapter.
pl: Każde z połączeń posiada swoje plusy i minusy oraz swoje ograniczenia – połączenie lokalne oferuje najmniejsze opóźnienia i najszybszy transfer danych, jednakże kosztem braku mobilności, analogicznie połączenie zdalne powoduje minimalne opóźnienia w przesyłaniu danych, ale za to umożliwia zdalne sterowanie całością. Wybór metody podłączenia zależy jedynie od własnych potrzeb, wymagań oraz technicznych możliwości. Oprogramowanie przygotowane zostało tak, aby zapewnić działanie w każdej z tych konfiguracji. Istnieje ponadto możliwość sterowania z poziomu sieci publicznej (internetu) - zostanie to opisane w odpowiednim rozdziale.

source: The package includes prepared software for **PC**, **Raspberry** and **Arduino**. The software architecture and the technologies used have been selected so as to eliminate as many delays as possible and ensure the fastest possible real-time data transfer.
pl: W pakiecie znajduje się przygotowane oprogramowanie dla **PC**, **Raspberry** oraz **Arduino**. Architektura oprogramowania i wykorzystane technologie zostały dobrane tak, aby pozwoliły na zniwelowanie tylu opóźnień na ile to tylko możliwe oraz zapewniły możliwie jak najszybszy transfer danych w czasie rzeczywistym.

source: For remote connection, instead of the Raspberry described in the examples, any PC can be used, e.g. a Lenovo mini-computer, or any other. The software also allows for any combination of structures, i.e. in any combination, **any PC, Raspberry or Arduino** can be the connector with the hardware. In future releases, support for **Nvidia Jetson** is also planned (as a client and as a self-sufficient server due to sufficient computing power).
pl: Przy połączeniu zdalnym zamiast opisywanego w przykładach Raspberry użyty może być dowolny komputer PC, np. mini-komputer Lenovo, lub każdy inny. Oprogramowanie pozwala też na dowolne łączenie konstrukcji, tj. w każdej kombinacji łącznikiem ze sprzętem może być dowolny **PC, Raspberry lub Arduino**. W kolejnych wersjach planowane jest również wsparcie dla **Nvidia Jetson** (jako klient i jako samowystarczalny serwer ze względu na wystarczającą moc obliczeniową).

source: **Note:** when Raspberry is connected, servo control can be done using its built-in GPIO pins, however, a much better solution is to control servos using a microcontroller like Arduino (higher control current, less interference, greater reliability, etc.). The optimal option is, for example, connecting the Raspberry (or other computer) via Wifi, and connecting the Arduino to the Raspberry via the serial interface (USB) and then connecting the servo only to the Arduino outputs. The commands are then received via Wifi using the Raspberry and forwarded to the Arduino via USB - in this case only the Arduino deals with communication with the hardware.
pl: **Uwaga:** w przypadku podłączenia Raspberry sterowanie serwomechanizmami może odbywać się za pomocą jego wbudowanych pinów GPIO, jednakże o wiele lepszym rozwiązaniem jest sterowanie serwami za pomocą mikrokontrolera jak Arduino (wyższy prąd sterujący, mniejsza ilość zakłóceń, większa niezawodność itd.). Optymalną opcją jest więc np. podłączenie Raspberry (lub innego komputera) za pomocą Wifi, a do Raspberry podłączenie Arduino poprzez interfejs szeregowy (USB) i podłączenie serwomechanizmu dopiero do wyjść w Arduino. Oprogramowanie pozwala na taki układ – komendy są wtedy odbierane poprzez Wifi za pomocą Raspberry i przekazywane dalej do Arduino za pomocą USB – w tym układzie dopiero Arduino zajmuje się komunikacją ze sprzętem. **Jest to najbardziej optymalna z możliwych opcji, pozwalająca na mobilność i największą bezawaryjność**.

source: All possible connection configurations are described below.
pl: Poniżej opisane są wszystkie możliwe konfiguracje podłączeniowe.

source: In this configuration, the computer controlling the device (server) connects to the client (which can be a **Raspberry** or any other PC) via **LAN** or **WLAN/WIFI**. **Raspberry** uses **Arduino** connected via the USB port to control the servos using the **GPIO pins of the PWM type from the Arduino** microcontroller and captures video from the camera connected via the **CSI** connector and then sends the video to the server via the network. The control computer (server) sends servo control commands to the client over the network. To use this configuration, run on the Raspberry the client application available in the **Client / PC, Raspberry** directory and then on the desktop (server) application, select the remote mode **CAM (IP)** and then select the servo connection from **Servo > Remote > (client IP address)** menu. If another computer (PC) with e.g. Arduino will be used instead of Raspberry, run the client application from the **Client / PC, Raspberry** directory on it and select **arduino** as the device in client's configuration.
pl: W tej konfiguracji komputer sterujący całoscią (serwer) łączy się z klientem (którym może być **Raspberry**, lub każdy inny dowolny komputer PC) poprzez **sieć LAN** lub **WLAN/WIFI**. **Raspberry** za pomocą podłączonego poprzez port USB **Arduino** steruje serwomechanizmami przy pomocy wyprowadzeń **GPIO typu PWM** z mikrokontrolera **Arduino** oraz pobiera obraz z podłączonej poprzez złącze **CSI** kamery i następnie przesyła obraz do komputera sterującego poprzez sieć. Komputer sterujący przesyła następnie do klienta po sieci komendy sterujące serwomechanizmami. Aby wykorzystać tę konfigurację należy uruchomić na Raspberry aplikację kliencką udostępnioną w katalogu **Client / PC, Raspberry,** a następnie z poziomu aplikacji desktopowej (serwerowej) wybrać tryb pracy zdalnej **KAM (IP)** oraz wybrać w menu połączenie serwa **Serwo / Zdalne / (adres IP klienta).** Jeśli zamiast Raspberry użyty zostanie inny komputer (PC) z np. Arduino to należy uruchomić na nim aplikację kliencką z katalogu **Client / PC, Raspberry** i wybrać jako urządzenie **arduino**.

source: Connecting pins in **Raspberry** (remotely) and **Arduino**, on the example of **Raspberry Pi 3 Model A+**:
pl: Podłączenie pinów w **Raspberry** (zdalnie) i w **Arduino**, na przykładzie **Raspberry Pi 3 Model A+**:

source: **The Arduino pin configuration can be changed in the C++ code included for Arduino - the code is in the Client/Arduino directory.**
pl: **Konfigurację pinów Arduino można zmienić w kodzie C++ załączonym dla Arduino - kod znajduje się w katalogu Client / Arduino.**

source: **Installation procedure of the client application on Raspberry, Arduino and PC is described in more detail in a separate chapter - Software / Client.**
pl: Procedura instalacji aplikacji klienckiej na Raspberry, Arduino i PC opisana jest szerzej w oddzielnym rozdziale - Software / Klient

source: **In the next releases, an additional option is planned to connect servomotors using any hardware driver for servos.**
pl: W kolejnej wersji planowana jest dodatkowo opcja podłączenia serwomotorów za pomocą dowolnego układu sterownika dla serw

source: In this configuration, the computer controlling the whole (server) connects to the client (which can be a **Raspberry** or any other PC) via **LAN** or **WLAN/WIFI**. The Raspberry, using the built-in **GPIO pins of the PWM type,** controls the servos and captures video from the camera connected via the **CSI** connector and then sends the video to the controlling computer via the network. The control computer then sends servo control commands to the client over the network. To use this configuration, run the client application available in the **Client / PC, Raspberry** directory on the Raspberry, and then on the desktop (server) application, select the **CAM (IP)** mode and then select the servo connection in **Servo > Remote > (client IP address).** menu. If another computer (PC) with e.g. Arduino will be used instead of Raspberry, run the client application from the **Client / PC, Raspberry** directory on it and select **arduino** as the device in client's configuration.
pl: W tej konfiguracji komputer sterujący całoscią (serwer) łączy się z klientem (którym może być **Raspberry**, lub każdy inny dowolny komputer PC) poprzez **sieć LAN** lub **WLAN/WIFI**. Raspberry za pomocą wbudowanych wyprowadzeń **GPIO typu PWM** steruje serwomechanizmami oraz pobiera obraz z podłączonej poprzez złącze **CSI** kamery i następnie przesyła obraz do komputera sterującego poprzez sieć. Komputer sterujący przesyła następnie do klienta po sieci komendy sterujące serwomechanizmami. Aby wykorzystać tę konfigurację należy uruchomić na Raspberry aplikację kliencką udostępnioną w katalogu **Client / PC, Raspberry**, a następnie z poziomu aplikacji desktopowej (serwerowej) wybrać tryb pracy zdalnej **KAM (IP)** oraz wybrać w menu połączenie serwa **Serwo / Zdalne / (adres IP klienta).** Jeśli zamiast Raspberry użyty zostanie inny komputer (PC) z np. Arduino to należy uruchomić na nim aplikację kliencką z katalogu **Client / PC, Raspberry** i wybrać jako urządzenie **arduino**.

source: Connecting pins in **Raspberry** (remotely), on the example of **Raspberry Pi 3 Model A+**:
pl: Podłączenie pinów w **Raspberry** (zdalnie), na przykładzie **Raspberry Pi 3 Model A+**:

source: **The ground (GND) of the servo power supply must be additionally connected to the GND pin of the Raspberry in this system.**
pl: **Masa (GND) zasilania serwomechanizmów musi być w tym układzie dodatkowo podłączona do pinu GND Raspberry.**

source: **Note:** instead of via the microUSB input (as in the diagram), the Raspberry can be connected directly to the 5V power board using the 5V and GND output pins in the Raspberry. However, this is not recommended due to the circumvention of all internals in this configuration. current protection in Raspberry.
pl: **Uwaga:** zamiast poprzez wejście microUSB (jak na schemacie), Raspberry można podłączyć bezpośrednio pod płytkę zasilajacą 5V za pomocą pinów wyjściowych 5V i GND w Raspberry. Nie jest to jednak zalecane ze względu na obejście w takiej konfiguracji wszystkich wewn. zabezpieczeń prądowych w Raspberry.

source: The configuration of pins for Raspberry can be changed in the **config.ini** file located in the directory with the client application and installed in the user's directory in the system (pins in the configuration should be defined **according to physical addresses** on the board, not with GPIO names):
pl: Konfigurację pinów dla Raspberry można zmienić w pliku **config.ini** znajdującym się w katalogu z aplikacją klienta i instalowanym w katalogu użytkownika w systemie (piny w konfiguracji należy podać **wg adresów fizycznych** na płytce, a nie za pomocą nazw GPIO):

source: In this configuration, the computer controlling the whole (server) is connected to the **Arduino microcontroller** via a serial port (**USB**). Arduino, using the built-in **GPIO pins of the PWM type,** controls the servos. The camera must be connected directly to the control computer via the USB port. The control software here takes care of the computational part and controls the movement of the servo motors with the connected Arduino by passing commands to it. To use this configuration, you need to upload the control code written in C++ to the Arduino (code is attached in the **Client / Arduino** directory), and then on the desktop (server) application, select **CAM (USB)** mode and then select the USB camera from the list and select the servo connection using option in the **Servo > Local > (serial port address)** menu.
pl: W tej konfiguracji komputer sterujący całoscią (serwer) podłączony jest do mikrokontrolera **Arduino** za pomocą portu szeregowego (**USB**). Arduino za pomocą wbudowanych wyprowadzeń **GPIO typu PWM** steruje serwomechanizmami. Kamera musi być podłączona bezpośrednio do komputera sterującego za pomocą portu USB. Oprogramowanie sterujące zajmuje się tutaj częścią obliczeniową i steruje ruchem serwomotorów za pomocą podłączonego Arduino poprzez przekazywane do niego komendy. Aby wykorzystać tę konfigurację należy wgrać na Arduino kod sterujący napisany w C++, załączony w katalogu **Client / Arduino**, a następnie z poziomu aplikacji desktopowej (serwerowej) wybrać tryb pracy **KAM (USB),** następnie wybrać z listy kamerę USB oraz wybrać połączenie serwa za pomocą opcji w menu **Serwo / Lokalne / (adres portu szeregowego)**.

source: Connecting pins in **Arduino** (locally), on the example of **Arduino Uno** / **Arduino Nano**:
pl: Podłączenie pinów w **Arduino** (lokalnie), na przykładzie **Arduino Uno** / **Arduino Nano**:

source: The pin configuration can be changed in the C++ code included for Arduino - the code is in the **Client / Arduino** directory.
pl: Konfigurację pinów można zmienić w kodzie C++ załączonym dla Arduino - kod znajduje się w katalogu Client / Arduino.

source: **Note:** serial connection with Raspberry requires configuration on the Raspberry side, Arduino is recommended for local connection, and Raspberry is recommended only for handling remote connections.
pl: **Uwaga:** połączenie szeregowe z Raspberry wymaga konfiguracji po stronie Raspberry, w podłączeniu lokalnym zalecane jest użycie Arduino, a Raspberry zaleca się przy połączeniu zdalnym.
